Обучение/src/InformationRegisters/ПрисоединенныеФайлы/ПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединенныеФайлы</name>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Обучение/src/Enums/ТипыХраненияФайлов/ТипыХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыХраненияФайлов</name>
  <enumValues>
    <name>ВБазе</name>
  </enumValues>
  <enumValues>
    <name>НаСервере</name>
  </enumValues>
</mdclass:Enum>

Обучение/src/CommonModules/ПрисоединенныеФайлыВызовСервера/Module.bsl
Функция НеОтображатьДиалогУстановкиРасширения() Экспорт

	Возврат ХранилищеОбщихНастроек.Загрузить("УстановкаРасширения") = "НеНапоминать";	

КонецФункции // НеОтображатьДиалогУстановкиРасширения()

Функция ПолучитьНавигационнуюСсылкуФайла(Ссылка, Расширение, ИдентификаторФормы, ВсеФайлы = Ложь)  Экспорт

	Если ВсеФайлы или ПрисоединенныеФайлыСервер.ЭтоГрафическийФайл(Расширение) Тогда
		
		Если Ссылка.ТипХранения = Перечисления.ТипыХраненияФайлов.ВБазе Тогда
			Возврат ПолучитьДанныеИзБазы(Ссылка);
		Иначе	
		    Возврат ПолучитьДанныхИзКаталога(Ссылка, ИдентификаторФормы);
		КонецЕсли;
		
	КонецЕсли;	

	Возврат "";
	
КонецФункции // ПолучитьНавигационнуюСсылкуФайла()

Функция ПолучитьДанныхИзКаталога(Ссылка, ИдентификаторФормы)

	ПутьКФайлу = ПрисоединенныеФайлыСервер.ПолучитьПутьКФайлуНаСервере(Ссылка);
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);	
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);		
	КонецЕсли;

КонецФункции // ПолучитьДанныхИзКаталога()

Функция ПолучитьДанныеИзБазы(Ссылка)

	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("ПрисоединенныйФайл", Ссылка);
	КлючЗаписи = РегистрыСведений.ПрисоединенныеФайлы.СоздатьКлючЗаписи(ЗначениеКлюча);
	
	Возврат ПолучитьНавигационнуюСсылку(КлючЗаписи, "Хранилище");		
	
КонецФункции // ПолучитьДанныеИзБазы()
